TexasInstruments/mcupsdk-core/examples/drivers/adc/adc_ppb_offset/am263x-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.13.0+2553"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc        = scripting.addModule("/drivers/adc/adc", {}, false);
const adc1       = adc.addInstance();
const epwm       = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1      = epwm.addInstance();
const epwm2      = epwm.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const int_xbar   = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1  = int_xbar.addInstance();
const int_xbar2  = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.adcClockPrescaler        = "ADC_CLK_DIV_3_0";
adc1.$name                    = "CONFIG_ADC1";
adc1.enableConverter          = true;
adc1.enableInterrupt1         = true;
adc1.interruptPulseMode       = "ADC_PULSE_END_OF_CONV";
adc1.ppb1SOCNumber            = "ADC_SOC_NUMBER1";
adc1.ppb2SOCNumber            = "ADC_SOC_NUMBER1";
adc1.interrupt1SOCSource      = "ADC_SOC_NUMBER1";
adc1.ppb2ReferenceOffset      = 50;
adc1.ppb1CalibrationOffset    = -100;
adc1.ppb3SOCNumber            = "ADC_SOC_NUMBER1";
adc1.ppb2CalibrationOffset    = 50;
adc1.ppb3CalibrationOffset    = 100;
adc1.ppb3ReferenceOffset      = 50;
adc1.ppb3EnableTwosComplement = true;
adc1.soc0SampleWindow         = 17;
adc1.soc1SampleWindow         = 17;
adc1.ADC.$assign              = "ADC1";

epwm1.$name                                                   = "CONFIG_EPWM0";
epwm1.epwmTimebase_period                                     = 2048;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable               = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar       = "1";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource               = "EPWM_SOC_TBCTR_ZERO";
epwm1.EPWM.$assign                                            = "EPWM0";

epwm2.$name                                                   = "CONFIG_EPWM1";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable               = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar       = "1";
epwm2.epwmTimebase_period                                     = 9999;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource               = "EPWM_SOC_TBCTR_ZERO";
epwm2.EPWM.$assign                                            = "EPWM1";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "ball.A7";
debug_log.uartLog.UART.TXD.$assign = "ball.A6";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC1_INT1"];

int_xbar2.$name      = "CONFIG_INT_XBAR1";
int_xbar2.xbarOutput = ["ADC1_INT2"];
int_xbar2.instance   = "INT_XBAR_1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN0.$suggestSolution          = "ball.T11";
adc1.ADC.AIN1.$suggestSolution          = "ball.U11";
adc1.ADC.AIN2.$suggestSolution          = "ball.T12";
adc1.ADC.AIN3.$suggestSolution          = "ball.V12";
adc1.ADC.AIN4.$suggestSolution          = "ball.U12";
adc1.ADC.AIN5.$suggestSolution          = "ball.R12";
epwm1.EPWM.A.$suggestSolution           = "ball.B2";
epwm1.EPWM.B.$suggestSolution           = "ball.B1";
epwm2.EPWM.A.$suggestSolution           = "ball.D3";
epwm2.EPWM.B.$suggestSolution           = "ball.D2";
debug_log.uartLog.UART.$suggestSolution = "UART0";
